# Вычислить число π c заданной точностью *d*
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001



import math
x=math.pi
n=input('Введите число d чтобы задать точность вывода числа π (например: 0.001, 0,01): ')
count = 0

n = n.replace('0.', '')

for i in n:
    count+=1

print(f'Число {x:.{count}f})